app/controllers/vacations_controller.rb

  def index
    if user_signed_in?
      if params[:year]
        @vacations = Vacation.year(params[:year])
      else
        @vacations = current_user.vacations
      end
    else
      redirect_to  new_user_session_path
    end
    current_user.calculate
    @years = current_user.vacations.map{|v| v[:start_date].year}.uniq
---
SELECT "vacations".* FROM "vacations" WHERE "vacations"."user_id" = ?  [["user_id", 3]]

  def create
    @vacation = Vacation.new(vacation_params)
    @vacation.user_id = current_user.id

    if vacation_params[:start_date] && vacation_params[:end_date] == ""
      flash[:notice] = "Please select dates"
      redirect_to new_vacation_path
    else
      @vacation.days_count = calculate_business_days
      if  @vacation.days_count > current_user.balance || current_user.balance < 1
        flash[:alert] = "Your balance is less than the specified number of days"
        redirect_to new_vacation_path
      else
        current_user.calculate
          unless validate_vacation_date(vacation_params, "create")
            flash[:notice] = "For these dates, already scheduled vacation, please choose other dates"
            redirect_to new_vacation_path
          else
            respond_to do |format|
              if @vacation.save
---
INSERT INTO "vacations" ("start_date", "end_date", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["start_date", "2018-01-09"], ["end_date", "2018-01-24"], ["description", "xxx"], ["created_at", "2018-01-07 18:22:04.762341"], ["updated_at", "2018-01-07 18:22:04.762341"], ["user_id", 2]]

  def update
    @vacation.days_count = calculate_business_days
    if vacation_params[:start_date] > vacation_params[:end_date]
      flash[:notice] = "Dates are not selected correctly"
      redirect_to edit_vacation_path
    else
      if  @vacation.days_count > current_user.balance || current_user.balance < 1
        flash[:alert] = "Your balance is less than the specified number of days"
        redirect_to edit_vacation_path
      else
        current_user.calculate

        unless validate_vacation_date(vacation_params, "update")
            flash[:notice] = "For these dates, already scheduled vacation, please choose other dates"
            redirect_to edit_vacation_path
        else
          respond_to do |format|
            if @vacation.update(vacation_params)
---
UPDATE "users" SET "balance" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["balance", 5], ["updated_at", "2018-01-10 19:29:47.459678"], ["id", 25]]
UPDATE "vacations" SET "days_count" = ?, "description" = ?, "end_date" = ?, "updated_at" = ? WHERE "vacations"."id" = ?  [["days_count", 2], ["description", "ЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯ"], ["end_date", "2018-01-15"], ["updated_at", "2018-01-12 20:00:02.716052"], ["id", 66]]

  def destroy
    current_user.calculate
    @vacation.destroy
---
DELETE FROM "vacations" WHERE "vacations"."id" = ?  [["id", 3]]

    def set_owner
      @vacation = Vacation.find(params[:id])
---
SELECT  "vacations".* FROM "vacations" WHERE "vacations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]